---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.FlowConversionMode
source: html/804bd904-a435-b0df-1c8c-8322d3fc8cca.htm
---
# Autodesk.Revit.DB.Plumbing.FlowConversionMode

Enumerated type listing possible flow conversion modes for piping calculations.

## Syntax (C#)
```csharp
public enum FlowConversionMode
```